nxp-mcuxpresso/mcux-soc-svd/KW45B41Z82/KW45B41Z82.xml
          <register>
            <name>TCD_BITER_ELINKNO</name>
            <description>TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled)</description>
            <alternateGroup>ELINKNO</alternateGroup>
            <addressOffset>0x3E</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0</resetMask>
            <fields>
              <field>
                <name>BITER</name>
                <description>Starting Major Iteration Count</description>
                <bitOffset>0</bitOffset>
                <bitWidth>15</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ELINK</name>
                <description>Enables Link</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>Channel-to-channel linking disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>Channel-to-channel linking enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TCD_BITER_ELINKYES</name>
            <description>TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled)</description>
            <alternateGroup>ELINKYES</alternateGroup>
            <addressOffset>0x3E</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0</resetMask>
            <fields>
              <field>
                <name>BITER</name>
                <description>Starting Major Iteration Count</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LINKCH</name>
                <description>Link Channel Number</description>
                <bitOffset>9</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ELINK</name>
                <description>Enable Link</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>Channel-to-channel linking disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>Channel-to-channel linking enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
      </registers>
    </peripheral>
    <peripheral>
      <name>EWM0</name>
      <description>EWM</description>
      <groupName>EWM</groupName>
      <baseAddress>0x40013000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x6</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>EWM0</name>
        <value>18</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Control</description>
          <addressOffset>0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>EWMEN</name>
              <description>EWM Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-writeOnce</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ASSIN</name>
              <description>Assertion State Select</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-writeOnce</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Logic 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Logic 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INEN</name>
              <description>Input Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-writeOnce</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTEN</name>
              <description>Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Deasserts interrupt requests</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_REQ</name>
                  <description>Generates interrupt requests</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SERV</name>
          <description>Service</description>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>SERVICE</name>
              <description>Service</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPL</name>
          <description>Compare Low</description>
          <addressOffset>0x2</addressOffset>
          <size>8</size>
          <access>read-writeOnce</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>COMPAREL</name>
              <description>Compare Low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-writeOnce</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPH</name>
          <description>Compare High</description>
          <addressOffset>0x3</addressOffset>
          <size>8</size>
          <access>read-writeOnce</access>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>COMPAREH</name>
              <description>Compare High</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-writeOnce</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKPRESCALER</name>
          <description>Clock Prescaler</description>
          <addressOffset>0x5</addressOffset>
          <size>8</size>
          <access>read-writeOnce</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CLK_DIV</name>
              <description>Clock Divider</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-writeOnce</access>
            </field>
          </fields>
        </register>
