nxp-mcuxpresso/mcux-soc-svd/KW45B41Z82/KW45B41Z82.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>XCVR_MISC</name>
      <description>XCVR_MISC</description>
      <groupName>XCVR_MISC</groupName>
      <baseAddress>0x48A07D00</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>XCVR_CTRL</name>
          <description>TRANSCEIVER CONTROL</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x140</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XCVR_SOFT_RESET</name>
              <description>transciever soft reset control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XCVR_SOFT_RESET_0</name>
                  <description>no soft reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XCVR_SOFT_RESET_1</name>
                  <description>enable soft reset on transciever</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPPS_ENABLE</name>
              <description>transciever lpps enable control</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPPS_ENABLE_0</name>
                  <description>no lpps feature</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPPS_ENABLE_1</name>
                  <description>enable lpps feature</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDCLK_OUT_EN</name>
              <description>sdclk out control</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SDCLK_OUT_EN_0</name>
                  <description>no sdclk out</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDCLK_OUT_EN_1</name>
                  <description>enable sdclk out</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEMOD_SEL</name>
              <description>Demodulator Selector</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEMOD_SEL_0</name>
                  <description>No demodulator selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEMOD_SEL_1</name>
                  <description>Use NXP Multi-standard PHY demodulator</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEMOD_SEL_2</name>
                  <description>Use Legacy 802.15.4 demodulator</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATA_RATE</name>
              <description>Radio data rate setting</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATA_RATE_0</name>
                  <description>2Mbps</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA_RATE_1</name>
                  <description>1Mbps</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA_RATE_2</name>
                  <description>500Kbps</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA_RATE_3</name>
                  <description>250Kbps</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATA_RATE_DRS</name>
              <description>Radio data rate setting, Data Rate Switch</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATA_RATE_DRS_0</name>
                  <description>2Mbps</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA_RATE_DRS_1</name>
                  <description>1Mbps</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA_RATE_DRS_2</name>
                  <description>500Kbps</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA_RATE_DRS_3</name>
                  <description>250Kbps</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REF_CLK_FREQ</name>
              <description>transciever ref clk freq control</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REF_CLK_FREQ_0</name>
                  <description>32MHz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REF_CLK_FREQ_1</name>
                  <description>26MHz</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FO_RX_EN</name>
              <description>Fast Overwrite RX Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FO_TX_EN</name>
              <description>Fast Overwrite TX Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOF_RX_SEL</name>
              <description>Time-of-Flight RX Select</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TOF_RX_SEL_0</name>
                  <description>PHY: aa_fnd_to_ll</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOF_RX_SEL_1</name>
                  <description>Localization Control: pattern_found</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TOF_TX_SEL</name>
              <description>Time-of-Flight TX Select</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TOF_TX_SEL_0</name>
                  <description>TSM: tx_dig_en</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOF_TX_SEL_1</name>
                  <description>TXDIG: pa_wu_complete</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LL_CFG_CAPT_DIS</name>
              <description>Link Layer Configuration Capture Disable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LL_CFG_CAPT_DIS_0</name>
                  <description>Enabled: Link Layer configuration inputs are captured.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LL_CFG_CAPT_DIS_1</name>
                  <description>Disabled: Link Layer configurations are not captured.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>XCVR_STATUS</name>
          <description>TRANSCEIVER STATUS</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF3F00</resetMask>
          <fields>
            <field>
              <name>TSM_COUNT</name>
              <description>TSM_COUNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TSM_IRQ0</name>
              <description>TSM Interrupt #0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TSM_IRQ0_0</name>
                  <description>TSM Interrupt #0 is not asserted.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSM_IRQ0_1</name>
                  <description>TSM Interrupt #0 is asserted. Write '1' to this bit to clear it.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSM_IRQ1</name>
              <description>TSM Interrupt #1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TSM_IRQ1_0</name>
                  <description>TSM Interrupt #1 is not asserted.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSM_IRQ1_1</name>
                  <description>TSM Interrupt #1 is asserted. Write '1' to this bit to clear it.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSM_BUSY</name>
              <description>tsm busy status</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_MODE</name>
              <description>Receive Mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_MODE</name>
              <description>Transmit Mode</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FAD_CTRL</name>
          <description>FAD CONTROL</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF080</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ANTX</name>
              <description>Antenna Selection State</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ANTX_OVRD_EN</name>
              <description>Antenna State Override Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANTX_OVRD</name>
              <description>Antenna State Override Value</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANTX_EN</name>
              <description>FAD Antenna Controls Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ANTX_EN_0</name>
                  <description>all disabled (held low)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANTX_EN_1</name>
                  <description>only RX/TX_SWITCH enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANTX_EN_2</name>
                  <description>only ANT_A/B enabled</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANTX_EN_3</name>
                  <description>all enabled</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANTX_CTRLMODE</name>
              <description>Antenna Diversity Control Mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANTX_POL</name>
              <description>FAD Antenna Controls Polarity</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAD_NOT_GPIO</name>
              <description>FAD versus GPIO Mode Selector</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAD_LANT_SEL</name>
              <description>FAD versus LANT_LUT_GPIO Selector</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAD_LANT_SEL_0</name>
                  <description>LANT_LUT_GPIO[3:0]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAD_LANT_SEL_1</name>
                  <description>{ANT_B, ANT_A, RX_SWITCH, TX_SWITCH}</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
